islombek90/Emdedded-c/STM32F0xxx/drivers/Src/stm32F0xxx_UART_Driver.c
/*
 * stm32F0xxx_UART_Driver.c
 *
 *  Created on: 16 авг. 2021 г.
 *      Author: Im
 */


#include "STM32F0xxx.h"

/*****************************************************************
 * @fn             -  USART_PeriClkControl
 *
 * @brief          - This function enables or disables the USART  clock
 *
 * @parama[in]     - the base address of USART port peripheral
 * @parama[in]     - The macros of Enable or Disable
 * @parama[in]     -
 *
 * @return         -None
 *
 * @note           -None
*/
void USART_PeriClkControl(USART_RegDef_t *pUSARTx, uint8_t EnorDI)
{
	if (EnorDI == ENABLE)
		{
			if( pUSARTx == USART1)
			{
				UART1_PCLK_EN();
			}
			else if ( pUSARTx == USART2)
			{
				UART2_PCLK_EN();
			}


		}
		else
			if( pUSARTx == USART1)
					{
						UART1_PCLK_DI();
					}
					else if ( pUSARTx == USART2)
					{
						UART2_PCLK_DI();
					}




}
/*****************************************************************
 * @fn             -  USART_PeripheralControl
 *
 * @brief          - This function enables or disables the USART  Peripheral
 *
 * @parama[in]     - the base address of USART port peripheral
 * @parama[in]     - The macros of Enable or Disable
 * @parama[in]     -
 *
 * @return         -None
 *
 * @note           -None
*/
//enable and disable USART peripheral
void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t EnorDI)
{
	if(EnorDI == ENABLE)
				{
			pUSARTx->USART_CR1 |= (1 << USART_CR1_UE);



				}
		else{

			pUSARTx->USART_CR1 &=~ (1 << USART_CR1_UE);
		}



}


/*****************************************************************
 * @fn             -  USART_SetBaudRate
 *
 * @brief          - This function controls the Baudrate selection
 *
 * @parama[in]     - the base address of USART port peripheral
 * @parama[in]     - Baudrate value
 * @parama[in]     -
 *
 * @return         -None
 *
 * @note           -None
*/

void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate)
{

	//Variable to hold the APB clock
	uint32_t PCLKx;

	uint32_t usartdiv;

	//variables to hold Mantissa and Fraction values
	uint32_t M_part,F_part;

  uint32_t tempreg=0;

  //Get the value of APB bus clock in to the variable PCLKx
  if(pUSARTx == USART1 || pUSARTx == USART2)
  {
	   //USART1 and USART6 are hanging on APB2 bus
	   PCLKx = 8000000;
  }else
  {
	   PCLKx = 8000000;
  }

  //Check for OVER8 configuration bit
  if(pUSARTx->USART_CR1 & (1 << USART_CR1_OVER8))
  {
	   //OVER8 = 1 , over sampling by 8
	   usartdiv = ((25 * PCLKx) / (2 *BaudRate));
  }else
  {
	   //over sampling by 16
	   usartdiv = ((25 * PCLKx) / (4 *BaudRate));
  }

  //Calculate the Mantissa part
  M_part = usartdiv/100;

  //Place the Mantissa part in appropriate bit position . refer USART_BRR
  tempreg |= M_part << 4;

  //Extract the fraction part
  F_part = (usartdiv - (M_part * 100));

  //Calculate the final fractional
  if(pUSARTx->USART_CR1 & ( 1 << USART_CR1_OVER8))
   {
	  //OVER8 = 1 , over sampling by 8
	  F_part = ((( F_part * 8)+ 50) / 100)& ((uint8_t)0x07);

   }else
   {
	   //over sampling by 16
	   F_part = ((( F_part * 16)+ 50) / 100) & ((uint8_t)0x0F);

   }

  //Place the fractional part in appropriate bit position . refer USART_BRR
  tempreg |= F_part;

  //copy the value of tempreg in to BRR register
  pUSARTx->USART_BRR = tempreg;
}

/*****************************************************************
 * @fn             -  USART_Init
 *
 * @brief          - This function inits the USART
 *
 * @parama[in]     -
 * @parama[in]     -
 * @parama[in]     -
 *
 * @return         -None
 *
 * @note           -None
*/
//USART init Deinit
void USART_Init(USART_handler_t *pUSARTHandler)
{
	//Temporary variable
	uint32_t tempreg=0;

/******************************** Configuration of CR1******************************************/

	//Implement the code to enable the Clock for given USART peripheral
	 USART_PeriClkControl(pUSARTHandler->pUSARTx,ENABLE);

	//Enable USART Tx and Rx engines according to the USART_Mode configuration item
	if ( pUSARTHandler->USART_Config.USART_Mode == USART_MODE_ONLY_RX)
	{
		//Implement the code to enable the Receiver bit field
		tempreg|= (1 << USART_CR1_RE);
	}else if (pUSARTHandler->USART_Config.USART_Mode == USART_MODE_ONLY_TX)
	{
		//Implement the code to enable the Transmitter bit field
		tempreg |= ( 1 << USART_CR1_TE );

	}else if (pUSARTHandler->USART_Config.USART_Mode == USART_MODE_TXRX)
	{
		//Implement the code to enable the both Transmitter and Receiver bit fields
		tempreg |= ( ( 1 << USART_CR1_RE) | ( 1 << USART_CR1_TE) );
	}

    //Implement the code to configure the Word length configuration item
	tempreg |= pUSARTHandler->USART_Config.USART_WordLength << USART_CR1_M0 ;


    //Configuration of parity control bit fields
	if ( pUSARTHandler->USART_Config.USART_ParityControl == USART_PARITY_EN_EVEN)
	{
		//Implement the code to enable the parity control
		tempreg |= ( 1 << USART_CR1_PCE);

		//Implement the code to enable EVEN parity
		//Not required because by default EVEN parity will be selected once you enable the parity control

	}else if (pUSARTHandler->USART_Config.USART_ParityControl == USART_PARITY_EN_ODD )
	{
		//Implement the code to enable the parity control
	    tempreg |= ( 1 << USART_CR1_PCE);

	    //Implement the code to enable ODD parity
	    tempreg |= ( 1 << USART_CR1_PS);

	}

   //Program the CR1 register
	pUSARTHandler->pUSARTx->USART_CR1 = tempreg;

/******************************** Configuration of CR2******************************************/

	tempreg=0;

	//Implement the code to configure the number of stop bits inserted during USART frame transmission
	tempreg |= pUSARTHandler->USART_Config.USART_StopBitMode << USART_CR2_STOP;

	//Program the CR2 register
	pUSARTHandler->pUSARTx->USART_CR2 = tempreg;

/******************************** Configuration of CR3******************************************/

	tempreg=0;

	//Configuration of USART hardware flow control
	if ( pUSARTHandler->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS)
	{
		//Implement the code to enable CTS flow control
		tempreg |= ( 1 << USART_CR3_CTSE);


	}else if (pUSARTHandler->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_RTS)
	{
		//Implement the code to enable RTS flow control
		tempreg |= ( 1 << USART_CR3_RTSE);

	}else if (pUSARTHandler->USART_Config.USART_HWFlowControl == USART_HW_FLOW_CTRL_CTS_RTS)
	{
		//Implement the code to enable both CTS and RTS Flow control
		tempreg |= ( 1 << USART_CR3_CTSE);
		tempreg |= ( 1 << USART_CR3_RTSE);
	}


	pUSARTHandler->pUSARTx->USART_CR3 = tempreg;

/******************************** Configuration of BRR(Baudrate register)******************************************/

	//Implement the code to configure the baud rate
	//We will cover this in the lecture. No action required here
	USART_SetBaudRate(pUSARTHandler->pUSARTx,pUSARTHandler->USART_Config.USART_BaudRate);


